#pragma once

#include "ofMain.h"

class ofApp : public ofBaseApp{
    
public:
    //--------------------------------------------------------------
    // setup関数: 実行時最初の1回実行される。実行時の初期設定（変数の初期化など）を記述。
    void setup(){
        
    }
    
    //--------------------------------------------------------------
    // update関数: 実行時にsetupの後、draw関数とともに繰り返し実行される。計算処理を記述。
    void update(){
        
    }
    
    //--------------------------------------------------------------
    // draw関数: 実行時にsetupの後、draw関数とともに繰り返し実行される。描画処理を記述。
    void draw(){
        
    }

    //--------------------------------------------------------------
    // mousePressed関数: マウスを押したときのイベントとして実行される
    void mousePressed(int x, int y, int button){
        
    
    }
    
};
