#include "ofApp.h" //ofApp.hファイルを読み込み（変数と関数の構成を一致させる）

//--------------------------------------------------------------
// setup関数: 実行時最初の1回実行される。実行時の初期設定（変数の初期化など）を記述。
void ofApp::setup(){

}

//--------------------------------------------------------------
// update関数: 実行時にsetupの後、draw関数とともに繰り返し実行される。計算処理を記述。
void ofApp::update(){

}

//--------------------------------------------------------------
// draw関数: 実行時にsetupの後、draw関数とともに繰り返し実行される。描画処理を記述。
void ofApp::draw(){

}

//--------------------------------------------------------------
// keyPressed関数: キーボードを押したときのイベントとして実行される
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
// keyReleased関数: キーボードを離したときのイベントとして実行される
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
// mouseMoved関数: マウスを動かしたとき（都度）のイベントとして実行される
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
// mouseDragged関数: マウスをドラッグしたとき（都度）のイベントとして実行される
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
// mousePressed関数: マウスを押したときのイベントとして実行される
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
// mouseReleased関数: マウスを離したときのイベントとして実行される
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
// mouseEntered関数: マウスが画面に入ってきたときのイベントとして実行される
void ofApp::mouseEntered(int x, int y){

}

//--------------------------------------------------------------
// mouseExited関数: マウスが画面から出たときのイベントとして実行される
void ofApp::mouseExited(int x, int y){

}

//--------------------------------------------------------------
// mouseExited関数: マウスが画面から出たときのイベントとして実行される
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
// gotMessage関数: マウスが画面から出たときのイベントとして実行される
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
// dragEvent関数: 画面にファイルをドラッグ&ドロップしたときのイベントとして実行される
void ofApp::dragEvent(ofDragInfo dragInfo){

}
